package Homework03;

public class Task03 {
    public static void main(String[] args) {
        //Пользователь загадывает число в диапазоне от [2 до 100]
        //Программа пытается его угадать (используйте метод бинарного поиска, т.е деление отрезка на 2).
        //Программа может задавать пользователю вопросы: Число равно ...?, Число больше ...?
        // и в зависимоти от ответа пользователя принимать решения.
        //Вместо текстовых ответов ДА/НЕТ, используйте числа 0 - НЕТ и 1 - ДА

    }
}
