package Homework05;

import java.util.Scanner;

public class Task03 {
    public static void main(String[] args) {
        //Задать массив на N слов. В цикле считывать с консоли слова (scanner.nextLine()),
        // и добавлять их в массив (добавлять новое слово в массив можно только, если в нем его еще нет).
        // В итоге в массиве будут только уникальные слова.
        //Выход из программы по слову exit (слово 'exit' в массив не добавлять) или если массив заполнен.
        // Перед завершением программы, вывести получившийся массив в консоль

        String[] wordArray = new String[10];





        }
    }

