package Homework.products;

//Свойства: максимальное количество белков / жиров / углеводов / калорий / список продуктов (массив)
//Реализовать метод, который принимает на Продукт и добавляет его в список, если характеристики продукта полностью
// соответствуют заявленным разрешениям, в противном случае сообщить, по какой причине продукт не может быть добавлен
// в список (например, слишком большое содержание калорий)
//Реализовать метод, который выводит названия всех продуктов из списка

public class MyProducts {

}
